/* No comment provided by engineer. */
"%@ (%@) : Connection Notice" = "%1$@ (%2$@) : Yhteyshuomautus";

/* first %@ is an account name; second is a service. This is a title for a window */
"%@ (%@) Setup" = "%1$@ (%2$@) Setup";

/* No comment provided by engineer. */
"%@ has 1 new message." = "%@ on yksi uusi viesti.";

/* No comment provided by engineer. */
"%@ is on your local contact list but not on the server list. Do you want to add this contact to your list?" = "%@ on paikallisessa ystäväluettelossa, muttei palvelimen luettelossa. Halouatko lisätä ystävän luetteloon?";

/* XMPP service discovery browser gateway tooltip */
"%@; double-click to register." = "%@; double-click to register.";

/* No comment provided by engineer. */
"(unknown)" = "(tuntematon)";

/* Placeholder displayed as the name of a new account */
"<New Account>" = "<Uusi tunnus>";

/* No comment provided by engineer. */
"Ad-Hoc command; double-click to execute" = "Ad-Hoc command; double-click to execute";

/* No comment provided by engineer. */
"Add" = "Lisää";

/* No comment provided by engineer. */
"Adium : Notice" = "Adium : Huomautus";

/* No comment provided by engineer. */
"Adium can't verify the identity of \"%@\"." = "Adium ei pysty varmentamaan käyttäjän \"%@\" henkilöllisyyttä.";

/* Message shown when a contact's profile can't be found */
"Adium could not find any information in the user's profile. This may not be a registered name." = "Adium ei kyennyt löytämään käyttäjän profiilia. Tämä nimi ei välttämättä ole rekisteriöty.";

/* No comment provided by engineer. */
"Adium Notice: %@" = "Adiumin huomautus: %@";

/* No comment provided by engineer. */
"Adium User" = "Adium User";

/* Button title to allow an action */
"Allow" = "Salli";

/* No comment provided by engineer. */
"Allow MSN Mobile pages?" = "Salli MSN Mobile -sivut";

/* No comment provided by engineer. */
"An error was encountered sending the file." = "Tiedostoa lähettäessä tapahtui virhe";

/* No comment provided by engineer. */
"Authenticating" = "Varmistetaan";

/* Connection step */
"Balancer handshake" = "Balancer handshake";

/* No comment provided by engineer. */
"Ban" = "Ban";

/* No comment provided by engineer. */
"Bankick" = "Bankick";

/* No comment provided by engineer. */
"Blocked" = "Torjuttu";

/* No comment provided by engineer. */
"Cancel" = "Peruuta";

/* No comment provided by engineer. */
"Cancel Presence Notification to %@" = "Cancel Presence Notification to %@";

/* Category table column header for the service discovery browser */
"Category" = "Kategoria";

/* Menu item title for changing the password of an account */
"Change Password" = "Vaihda salasana";

/* No comment provided by engineer. */
"Conference service; double-click to join" = "Conference service; double-click to join";

/* Button title to connect; this is a verb */
"Connect" = "Yhdistä";

/* Connection step */
"Connected" = "Yhdistetty";

/* No comment provided by engineer. */
"Connecting" = "Yhdistetään";

/* No comment provided by engineer. */
"Connection error." = "Yhteysvirhe";

/* No comment provided by engineer. */
"Contact list synchronization error for %@" = "Virhe sykronoitaessa ystäväluetteloa tunnuksessa: %@";

/* No comment provided by engineer. */
"Continue" = "Jatka";

/* No comment provided by engineer. */
"Delete" = "Poista";

/* No comment provided by engineer. */
"Delete & Unregister" = "Poista ja poista rekisteröinti";

/* No comment provided by engineer. */
"Delete Account" = "Poista tunnus";

/* No comment provided by engineer. */
"Delete Account from Server" = "Delete Account from Server";

/* No comment provided by engineer. */
"Delete the account %@? You can also optionally unregister the account on the server if possible." = "Delete the account %@? You can also optionally unregister the account on the server if possible.";

/* No comment provided by engineer. */
"Deop" = "Deop";

/* No comment provided by engineer. */
"Devoice" = "Devoice";

/* No comment provided by engineer. */
"Directory service; double-click to search" = "Directory service; double-click to search";

/* Button title to prevent an action */
"Disallow" = "Disallow";

/* No comment provided by engineer. */
"Discovery Browser" = "Discovery Browser";

/* No comment provided by engineer. */
"Do you want to allow or disallow people on your buddy list to send you MSN Mobile pages to your cell phone or other mobile device?" = "Do you want to allow or disallow people on your buddy list to send you MSN Mobile pages to your cell phone or other mobile device?";

/* Used as a label for a username specified by email address */
"Email" = "Email";

/* Connection step */
"Exchanging key hash" = "Exchanging key hash";

/* No comment provided by engineer. */
"Fetching..." = "Fetching...";

/* No comment provided by engineer. */
"File Send Error" = "File Send Error";

/* Generic fields request window title */
"Form" = "Form";

/* No comment provided by engineer. */
"From: " = "From: ";

/* No comment provided by engineer. */
"GG Number" = "GG Number";

/* Error message displayed when the server reports username or password as being incorrect. */
"Group for added contacts" = "Ryhmä lisätyille yhteystiedoille";
"Incorrect username or password" = "Incorrect username or password";

/* No comment provided by engineer. */
"Info" = "Info";

/* No comment provided by engineer. */
"Initializing Stream" = "Initializing Stream";

/* No comment provided by engineer. */
"Initiate Multiuser Chat with %@" = "Initiate Multiuser Chat with %@";

/* No comment provided by engineer. */
"Invite" = "Invite";

/* No comment provided by engineer. */
"IRC (Internet Relay Chat)" = "IRC (Internet Relay Chat)";

/* No comment provided by engineer. */
"Jabber ID" = "Jabber ID";

/* JID (Jabber ID) table column header for the service discovery browser. This may not need to be localized. */
"JID" = "JID";

/* No comment provided by engineer. */
"Join" = "Join";

/* No comment provided by engineer. */
"Kick" = "Kick";

/* No comment provided by engineer. */
"Launch %@" = "Launch %@";

/* No comment provided by engineer. */
"Let others know what I am listening to" = "Kerro muille, mitä kuuntelen";
"Looking up server" = "Looking up server";

/* user mood tooltip title */
"Mood" = "Mood";

/* Name table column header for the service discovery browser */
"Name" = "Nimi";

/* No comment provided by engineer. */
"New Mail" = "Uusi sähköposti";

/* Sample name and server for new IRC accounts */
"nickname" = "nickname";

/* Name for IRC user names */
"Nickname" = "Nickname";

/* No comment provided by engineer. */
"No reason was given." = "Erityistä syytä ei annettu.";

/* No comment provided by engineer. */
"No server has been configured for the %@ account %@. Please enter one below to connect" = "No server has been configured for the %1$@ account %2$@. Please enter one below to connect";

/* No comment provided by engineer. */
"No Server Specified" = "No Server Specified";

/* No comment provided by engineer. */
"Node:" = "Node:";

/* No comment provided by engineer. */
"OK" = "Ok";

/* No comment provided by engineer. */
"Only when a request is accepted and the contact added to the list." = "Vain kun pyyntö hyväksytään ja yhteystieto lisätään luetteloon.";
"Op" = "Op";

/* No comment provided by engineer. */
"Open Mail in Browser" = "Open Mail in Browser";

/* Name for the orphans group */
"Orphans" = "Orphans";

/* No comment provided by engineer. */
"Parse Error." = "Parse Error.";

/* No comment provided by engineer. */
"Ping %@" = "Ping %@";

/* No comment provided by engineer. */
"Priority when available" = "Prioriteetti paikalla ollessa";
"Priority when away" = "Prioriteetti poissa ollessa";
"Re-request Authorization from %@" = "Pyydää udelleen lupaa henkilöltä: %@";

/* Connection step */
"Reading data" = "Luetaan dataa";

/* Connection step */
"Reading server key" = "Luetaan palvelimen avainta";

/* No comment provided by engineer. */
"Really remove gateway?" = "Really remove gateway?";

/* alert default button */
"Remove" = "Remove";

/* gateway menu item */
"Remove gateway" = "Remove gateway";

/* Roster - the Jabber default group */
"Resource" = "Resurssi";
"Roster" = "Roster";

/* No comment provided by engineer. */
"Search for Users" = "Search for Users";

/* No comment provided by engineer. */
"Search Results" = "Search Results";

/* No comment provided by engineer. */
"Send" = "Lähetä";

/* No comment provided by engineer. */
"Send Message" = "Send Message";

/* Window title for the service discovery browser */
"Service Discovery Browser" = "Service Discovery Browser";

/* No comment provided by engineer. */
"Service:" = "Service:";

/* No comment provided by engineer. */
"Set Mood" = "Set Mood";

/* No comment provided by engineer. */
"Set Nickname" = "Set Nickname";

/* No comment provided by engineer. */
"Set User Info" = "Muuta omia tietoja";

/* Title for the MSN display name setting dialogue box */
"Set your friendly name." = "Aseta näyttönimi";

/* Title for the dialogue prompting for your home phone number */
"Set your home phone number." = "Aseta oma kotipuhelin";

/* Title for the dialogue prompting for your mobile phone number */
"Set your mobile phone number." = "Aseta oma matkapuhelin";

/* Title for the dialogue prompting for your work phone number */
"Set your work phone number." = "Aseta oma työpuhelin";

/* No comment provided by engineer. */
"Show Server Certificate" = "Show Server Certificate";

/* No comment provided by engineer. */
"Subject: " = "Aihe:";

/* No comment provided by engineer. */
"Temporarily Hide From %@" = "Piilota väliaikaisesti henkilöltä: %@";

/* No comment provided by engineer. */
"The certificate of the server %@ is not trusted, which means that the server's identity cannot be automatically verified. Do you want to continue connecting?\n\nFor more information, click \"Show Certificate\"." = "The certificate of the server %@ is not trusted, which means that the server's identity cannot be automatically verified. Do you want to continue connecting?\n\nFor more information, click \"Show Certificate\".";

/* No comment provided by engineer. */
"The name you entered is not registered. Check to ensure you typed it correctly." = "The name you entered is not registered. Check to ensure you typed it correctly.";

/* No comment provided by engineer. */
"The other user is in your deny list." = "Olet torjunut toisen käyttäjän.";

/* No comment provided by engineer. */
"The other user is temporarily unavailable." = "Toinen käyttäjä ei ole tällä hetkellä tavoitettavissa.";

/* Description for the MSN display name setting dialogue. */
"This is the name that other MSN buddies will see you as." = "MSN ystäväsi näkevät sinunt tällä nimellä.";

/* No comment provided by engineer. */
"This node does not provide any services accessible to this program." = "This node does not provide any services accessible to this program.";

/* No comment provided by engineer. */
"This node provides ad-hoc commands. Open the context menu to access them." = "This node provides ad-hoc commands. Open the context menu to access them.";

/* No comment provided by engineer. */
"This operation would remove the gateway %@ itself and all contacts belonging to the gateway on your contact list. It cannot be undone." = "This operation would remove the gateway %@ itself and all contacts belonging to the gateway on your contact list. It cannot be undone.";

/* user tune tooltip title */
"Tune" = "Tune";

/* No comment provided by engineer. */
"Un-hide From %@" = "Un-hide From %@";

/* No comment provided by engineer. */
"Unable to parse the server list at %@. Please try again later." = "Unable to parse the server list at %@. Please try again later.";

/* No comment provided by engineer. */
"Unsubscribe %@" = "Poista tilaus %@";

/* Sample name and server for new livejournal accounts */
"username" = "käyttäjänimi";

/* Sample name and server for new Jabber accounts */
"username@jabber.org" = "käyttäjänimi@jabber.org";

/* No comment provided by engineer. */
"Verify Certificate" = "Varmenna sertifikaatti";

/* No comment provided by engineer. */
"View %@'s %@ web profile" = "View %1$@'s %2$@ web profile";

/* No comment provided by engineer. */
"Voice" = "Voice";

/* No comment provided by engineer. */
"Waiting for Response" = "Waiting for Response";

/* No comment provided by engineer. */
"Warning level is too high." = "Varoitustaso on liian korkea.";

/* No comment provided by engineer. */
"WARNING! This will delete the account %@ from the Jabber server, and can not be undone.\nAre you sure you want to proceed?" = "WARNING! This will delete the account %@ from the Jabber server, and can not be undone.\nAre you sure you want to proceed?";

/* No comment provided by engineer. */
"When someone asks to see my status" = "Kun joku pyytää nähdä tilani";
"XML Console" = "XML Konsoli";

/* No comment provided by engineer. */
"You are sending messages too quickly; wait a moment and try again." = "Lähetät viestejä liian tiheään tahtiin. Odota hetki ja yritä uudelleen.";

/* No comment provided by engineer. */
"You have 1 new message." = "Sinulla on 1 uusi viesti.";

/* No comment provided by engineer. */
"You have mail!\n" = "Sinulle on uusi sähköposti!";

/* No comment provided by engineer. */
"Your message to %@ did not get sent" = "Your message to %@ did not get sent";

/* No comment provided by engineer. */
"Your message was refused by the other user." = "Vastaanottaja ei ottanut viestiäsi vastaan.";

/* No comment provided by engineer. */
"Your message was too big." = "Viestisi oli liian pitkä.";

/* Restored from historic nib translations (arm64 revival) */
"Authorization Domain:" = "Kirjautumispalvelin:";
"Authorization User:" = "Käyttäjätunnus:";
"Chat Room Name:" = "Chat Room Name:";
"Connection:" = "Yhteys:";
"Encoding:" = "Encoding:";
"Handle:" = "Handle:";
"Invite Contacts:" = "Invite Contacts:";
"Password:" = "Password:";
"Publish Status to Everyone" = "Julkinen tila";
"Register New Account" = "Rekisteröi uusi tunnus";
"Server:" = "Server:";
"Use SIP proxy:" = "Käytä SIP-välitystä:";
"Use UDP" = "Käytä UDP:ta";
"With Message:" = "With Message:";

/* Machine-translated for the arm64 revival */
"(optional)" = "(valinnainen)";
"Accept" = "Hyväksy";
"Accept and Add To List" = "Hyväksy ja lisää luetteloon";
"Allow plaintext authentication" = "Salli salaamaton tunnistautuminen";
"Ask What To Do" = "Kysy mitä tehdään";
"Available Priority:" = "Paikalla-tilan prioriteetti:";
"Away Priority:" = "Poissa-tilan prioriteetti:";
"BOSH Server:" = "BOSH-palvelin:";
"Channel:" = "Kanava:";
"Connect Server:" = "Yhteyspalvelin:";
"Deny" = "Hylkää";
"Dismiss" = "Ohita";
"Display new mail notifications" = "Näytä ilmoitukset uusista sähköposteista";
"Do strict certificate checks" = "Tarkista varmenteet tiukasti";
"Don't download" = "Älä lataa";
"Don't show channel posts as messages" = "Älä näytä kanavajulkaisuja viesteinä";
"Don't show status updates as messages" = "Älä näytä tilapäivityksiä viesteinä";
"Either enter your XMPP server address here:" = "Anna XMPP-palvelimesi osoite tähän:";
"Encrypt connection using SSL" = "Salaa yhteys SSL:llä";
"Execute commands on connect:" = "Suorita komennot yhdistettäessä:";
"File Transfer Proxies:" = "Tiedostonsiirron välityspalvelimet:";
"Force old-style SSL" = "Pakota vanhanmallinen SSL";
"Full resolution" = "Täysi tarkkuus";
"Hostname:" = "Palvelimen osoite:";
"Let others know what iTunes is playing" = "Kerro muille, mitä iTunes soittaa";
"Logon QR Code" = "Kirjautumisen QR-koodi";
"Mail:" = "Sähköposti:";
"Music:" = "Musiikki:";
"Phone Number" = "Puhelinnumero";
"Please enter pairing code or scan the QR code" = "Anna paritustunnus tai lue QR-koodi";
"Presence Subscriptions:" = "Läsnäolotilaukset:";
"Profile pictures:" = "Profiilikuvat:";
"Read" = "Luettu";
"Realname:" = "Oikea nimi:";
"Registering…" = "Rekisteröidään…";
"Request New Account" = "Pyydä uutta tunnusta";
"Require SSL/TLS" = "Vaadi SSL/TLS";
"Resource:" = "Resurssi:";
"Security:" = "Suojaus:";
"Separate contacts’ names with commas." = "Erota ystävien nimet pilkuilla.";
"Server Name" = "Palvelimen nimi";
"Small (preview)" = "Pieni (esikatselu)";
"This contact is calling you. Adium does not support WhatsApp calls." = "Tämä ystävä soittaa sinulle. Adium ei tue WhatsApp-puheluita.";
"This contact is trying to call you. Adium does not support WhatsApp calls." = "Tämä ystävä yrittää soittaa sinulle. Adium ei tue WhatsApp-puheluita.";
"Username (Ident):" = "Käyttäjänimi (Ident):";
"Visit Server Homepage" = "Avaa palvelimen kotisivu";
"and add to list in group:" = "ja lisää luetteloon ryhmään:";

/* Strings the code localizes which had never been extracted; English value = key. */
"%@ has %lu new messages." = "Tunnuksessa %@ on %lu uutta viestiä.";
"...add to list in group:" = "...lisää luetteloon ryhmään:";
"Display custom emoticons" = "Näytä mukautetut hymiöt";
"Emoticons:" = "Hymiöt:";
"Encryption:" = "Salaus:";
"Let others know when you are typing" = "Näytä muille milloin kirjoitan viestiä";
"One per line, / is optional. $me will be replaced with your current nickname." = "Yksi riviä kohden, / on valinnainen. $me korvataan nykyisellä nimimerkilläsi.";
"or select a public server from the list:" = "tai valitse julkinen palvelin luettelosta:";
"Port:" = "Portti:";
"Status:" = "Tila:";
"Typing:" = "Kirjoittaminen:";
"You have %lu new messages." = "Sinulla on %lu uutta viestiä.";

/* The rebuilt account area: the fields the protocol descriptions produce.
   Those classes live in AdiumLibpurple, so the lookup happens here. */
/* Name this computer gives itself in another device's list of linked devices. %@ is the computer's name. */
"Adium on %@" = "Adium koneella %@";

/* No comment provided by engineer. */
"Server" = "Palvelin";

/* No comment provided by engineer. */
"Port" = "Portti";

/* Label a service takes from AIPurpleServiceDescriptors.plist for the account name row */
"Account Name" = "Tunnuksen nimi";

/* No comment provided by engineer. */
"Execute commands on connect" = "Suorita komennot yhdistettäessä";

/* Explains how the commands sent after connecting to IRC are written */
"One per line, without the leading slash." = "Yksi riviä kohden, ilman alussa olevaa /-merkkiä.";

/* Row asking how good a contact's picture is worth fetching */
"Profile picture quality" = "Profiilikuvien laatu";

/* WhatsApp profile picture quality: the full sized picture */
"Original" = "Alkuperäinen";

/* WhatsApp profile picture quality: the small version */
"Preview" = "Esikatselu";

/* WhatsApp profile picture quality: fetch no pictures at all */
"Do not load" = "Älä lataa";
